In [4]:
import pandas as pd
import numpy as np

In [65]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['Parkash','Pakistan','India','Heerani']})
df.head()

   col1  col2      col3
0     1   444   Parkash
1     2   555  Pakistan
2     3   666     India
3     4   444   Heerani

In [13]:
df.head()

   col1  col2      col3
0     1   444   Parkash
1     2   555  Pakistan
2     3   666     India
3     4   444   Heerani

In [18]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [19]:
df['col2'].nunique()

3

In [20]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [25]:
df[df['col1'] < 3]

   col1  col2      col3
0     1   444   Parkash
1     2   555  Pakistan

In [26]:
df[df['col2']  == 444]

   col1  col2     col3
0     1   444  Parkash
3     4   444  Heerani

In [28]:
def square(x):
    return x**2

In [22]:
df.head()

   col1  col2      col3
0     1   444   Parkash
1     2   555  Pakistan
2     3   666     India
3     4   444   Heerani

In [38]:
df['col3'].apply(len)

0    7
1    8
2    5
3    7
Name: col3, dtype: int64

In [41]:
df['col2'].sum()

2109

In [45]:
df['col2'].std()

106.27440896095354

In [48]:
del df['col1']

In [50]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [51]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [49]:
df

   col2      col3
0   444   Parkash
1   555  Pakistan
2   666     India
3   444   Heerani

In [55]:
df.sort_values(by = 'col2', ascending = False)

   col2      col3
2   666     India
1   555  Pakistan
0   444   Parkash
3   444   Heerani

In [57]:
df.isnull().sum()

col2    0
col3    0
dtype: int64

In [58]:
df.dropna()

   col2      col3
0   444   Parkash
1   555  Pakistan
2   666     India
3   444   Heerani

In [60]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [61]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [62]:
df.pivot_table(values = 'D', index = ['A', 'B'], columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [67]:
df

   col1  col2      col3
0     1   444   Parkash
1     2   555  Pakistan
2     3   666     India
3     4   444   Heerani

In [66]:
df.corr()

         col1     col2
col1  1.00000  0.13484
col2  0.13484  1.00000

In [68]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
col1    4 non-null int64
col2    4 non-null int64
col3    4 non-null object
dtypes: int64(2), object(1)
memory usage: 176.0+ bytes